
BUTTONS: dict[str] = {
    'авторизация': 'Авторизация',
}

GREETINGS: dict[str] = {
    'старт': 'Привет! Это бот который поможет Вам транслировать посты из соцсети <b>ВКонтакте</b> прямо в <b>телеграм</b>. '
             'Давайте все настроим:\n1. Для начала Вам нужно авторизоваться в ВК. Для этого нажмите кнопку снизу.\n'
             '2. Выбрать группу ВК, посты которой нужно транслировать.\n'
             '3. Указать телеграм-канал и добавить бота в состав его администраторов с возможностью публиковать сообщения.\n'
             'После настройки, все что вы публикуете в ВК будет автоматически публиковаться в телеграм-канале.',
    'ошибка': 'Извините, произошла ошибка. Пожалуйста сообщите об этом администратору.',
    'нет токена': 'Я не нашел в Вашем сообщении access token, пожалуйста следуйте инструкциям.',
    'нет пользователя': 'Я не нашел в Вашем сообщении user_id, пожалуйста следуйте инструкциям.',
    'главное меню': 'Выберите раздел который Вас интересует:',
    'найти': 'Введите что-нибудь из того, что хотите найти:',
    'поискать': 'Я могу поискать...',
    'избранное': 'Ищу...',
    'топ': 'Ищу...',
    'ищу': 'Ищу...',
    'не найдено': 'К сожалению ничего подходящего нет!',
    'избранного нет': 'Вы сюда ничего не добавили!',
    'случайно': 'Ищу случайную пасту!',
    'темы': 'Выберите к какой теме должен относится текст либо введите её самостоятельно:',
    'тема не выбрана': 'Сначала выберите тему.',
    'много тем': 'Пожалуйста выберите не более 3-х тем.',
    'новый пост': 'Вставьте сюда текст:',
    'новая картинка': 'Вставьте сюда ссылку на картинку либо пропустите этот шаг:',
    'новый пост получен': 'Благодарим, что поделились с нами Вашим текстом. Мы опубликуем его после премодерации.',
    'слишком короткий': 'Извините, Ваш текст слишком короткий, он должен содержать не менее 300 символов.',
    'повтор': 'Извините, мы уже получили Ваш текст. Скоро мы его посмотрим.',
    'не правильная ссылка': 'Извините, отправленная ссылка имеет не правильный формат.',
}

